"prompt","query"
"Find 10 genes.","MATCH (g:Gene) RETURN g LIMIT 10"
"Can you please give me 10 genes?","MATCH (g:Gene) RETURN g LIMIT 10"
"Can you return 10 genes?","MATCH (g:Gene) RETURN g LIMIT 10"
"Fetch 10 genes with a positive genetic constraint.","MATCH (g:Gene) WHERE g.geneticConstraint > 0 RETURN g LIMIT 10"
"Can you fetch 10 genes with a positive genetic constraint?","MATCH (g:Gene) WHERE g.geneticConstraint > 0 RETURN g LIMIT 10"
"Can you list 10 genes with a positive genetic constraint?","MATCH (g:Gene) WHERE g.geneticConstraint > 0 RETURN g LIMIT 10"
"Find 10 pathways.","MATCH (p:Pathway) RETURN p LIMIT 10"
"Can you please give me 10 pathways?","MATCH (p:Pathway) RETURN p LIMIT 10"
"Can you return 10 pathways?","MATCH (p:Pathway) RETURN p LIMIT 10"
"Find 10 Reactome entries.","MATCH (r:Reactome) RETURN r LIMIT 10"
"Can you please give me 10 Reactome entries?","MATCH (r:Reactome) RETURN r LIMIT 10"
"Can you return 10 Reactome entries?","MATCH (r:Reactome) RETURN r LIMIT 10"
"Find 10 drugs.","MATCH (d:Drug) RETURN d LIMIT 10"
"Can you please give me 10 drugs?","MATCH (d:Drug) RETURN d LIMIT 10"
"Can you return 10 drugs?","MATCH (d:Drug) RETURN d LIMIT 10"
"Find 10 Doid diseases.","MATCH (d:Doid.Disease.Disease) RETURN d LIMIT 10"
"Can you please give me 10 Doid diseases?","MATCH (d:Doid.Disease.Disease) RETURN d LIMIT 10"
"Can you return 10 Doid diseases?","MATCH (d:Doid.Disease.Disease) RETURN d LIMIT 10"
"Find 10 EFO diseases.","MATCH (d:Efo.Disease.Disease) RETURN d LIMIT 10"
"Can you please give me 10 EFO diseases?","MATCH (d:Efo.Disease.Disease) RETURN d LIMIT 10"
"Can you return 10 EFO diseases?","MATCH (d:Efo.Disease.Disease) RETURN d LIMIT 10"
"Find 10 GO diseases.","MATCH (d:Go.Disease.Disease) RETURN d LIMIT 10"
"Can you please give me 10 GO diseases?","MATCH (d:Go.Disease.Disease) RETURN d LIMIT 10"
"Can you return 10 GO diseases?","MATCH (d:Go.Disease.Disease) RETURN d LIMIT 10"
"Find 10 diseases.","MATCH (n:Disease) RETURN n LIMIT 100"
"Can you please give me 10 diseases?","MATCH (n:Disease) RETURN n LIMIT 100"
"Can you return 10 diseases?","MATCH (n:Disease) RETURN n LIMIT 100"
"Find 10 GO terms.","MATCH (n:GoTerm) RETURN n LIMIT 25"
"Can you please give me 10 GO terms?","MATCH (n:GoTerm) RETURN n LIMIT 25"
"Can you return 10 GO terms?","MATCH (n:GoTerm) RETURN n LIMIT 25"
"Give me 10 gene ontologies.","MATCH (n:GoTerm) RETURN n LIMIT 10"
"Can you please give me 10 gene ontologies?","MATCH (n:GoTerm) RETURN n LIMIT 10"
"Can you return 10 gene ontologies?","MATCH (n:GoTerm) RETURN n LIMIT 10"
"Can you please give me 10 gene ontology terms?","MATCH (n:GoTerm) RETURN n LIMIT 10"
"Can you return 10 gene ontology terms?","MATCH (n:GoTerm) RETURN n LIMIT 10"
"Find 10 genes associated by data source with diseases.","MATCH (g:Gene)-[r:AssociationByDataSource]-(d:Disease) RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases by data source?","MATCH (g:Gene)-[r:AssociationByDataSource]-(d:Disease) RETURN g, d, r LIMIT 10"
"Find 10 genes associated by data source direct/indirect with diseases.","MATCH (g:Gene)-[r:AssociationByDataSourceDirectIndirect]-(d:Disease) RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases by data source direct/indirect?","MATCH (g:Gene)-[r:AssociationByDataSourceDirectIndirect]-(d:Disease) RETURN g, d, r LIMIT 10"
"Find 10 genes associated by data type with diseases.","MATCH (g:Gene)-[r:AssociationByDataType]-(d:Disease) RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases by data type?","MATCH (g:Gene)-[r:AssociationByDataType]-(d:Disease) RETURN g, d, r LIMIT 10"
"Find 10 genes associated by data type direct/indirect with diseases.","MATCH (g:Gene)-[r:AssociationByDataTypeDirectIndirect]-(d:Disease) RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases by data type direct/indirect?","MATCH (g:Gene)-[r:AssociationByDataTypeDirectIndirect]-(d:Disease) RETURN g, d, r LIMIT 10"
"Find 10 genes associated overall with diseases.","MATCH (g:Gene)-[r:AssociationByOverall]-(d:Disease) RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases overall?","MATCH (g:Gene)-[r:AssociationByOverall]-(d:Disease) RETURN g, d, r LIMIT 10"
"Find 10 genes associated overall direct/indirect with diseases.","MATCH (g:Gene)-[r:AssociationByOverallDirectIndirect]-(d:Disease) RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases overall direct/indirect?","MATCH (g:Gene)-[r:AssociationByOverallDirectIndirect]-(d:Disease) RETURN g, d, r LIMIT 10"
"Find 10 genes associated by data source with diseases and score > 0.5.","MATCH (g:Gene)-[r:AssociationByDataSource]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases with a score greater than 0.5 from data source?","MATCH (g:Gene)-[r:AssociationByDataSource]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Find 10 genes associated by data source direct/indirect with diseases and score > 0.5.","MATCH (g:Gene)-[r:AssociationByDataSourceDirectIndirect]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases with a score greater than 0.5 from data source direct/indirect?","MATCH (g:Gene)-[r:AssociationByDataSourceDirectIndirect]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Find 10 genes associated by data type with diseases and score > 0.5.","MATCH (g:Gene)-[r:AssociationByDataType]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases with a score greater than 0.5 from data type?","MATCH (g:Gene)-[r:AssociationByDataType]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Find 10 genes associated by data type (direct/indirect) with diseases and score > 0.5.","MATCH (g:Gene)-[r:AssociationByDataTypeDirectIndirect]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases with a score greater than 0.5 from data type (direct/indirect)?","MATCH (g:Gene)-[r:AssociationByDataTypeDirectIndirect]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Find 10 genes associated overall with diseases and score > 0.5.","MATCH (g:Gene)-[r:AssociationByOverall]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases with a score greater than 0.5 overall?","MATCH (g:Gene)-[r:AssociationByOverall]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Find 10 genes associated overall direct/indirect with diseases and score > 0.5.","MATCH (g:Gene)-[r:AssociationByOverallDirectIndirect]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
"Can you please give me 10 genes and their associated diseases with a score greater than 0.5 overall direct/indirect?","MATCH (g:Gene)-[r:AssociationByOverallDirectIndirect]-(d:Disease) WHERE r.score > 0.5 RETURN g, d, r LIMIT 10"
